matthewdeanmartin/nanacoin/nanacoin_rs/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=65536
CONFIG_NVS_ALLOCATE_CACHE_IN_SPIRAM=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=65536
CONFIG_FREERTOS_UNICORE=n
CONFIG_ESP_WIFI_TASK_PINNED_TO_CORE_0=y
CONFIG_LWIP_TCPIP_TASK_AFFINITY_CPU0=y
CONFIG_ESP_HTTPS_SERVER_ENABLE=y
CONFIG_ESP_TLS_SERVER=y
CONFIG_ESP_TLS_SERVER_SESSION_TICKETS=y
CONFIG_MBEDTLS_DYNAMIC_BUFFER=n
# TLS contexts/buffers belong in plentiful PSRAM, leaving internal RAM for
# Wi-Fi and task stacks. Full records accommodate browser handshake/HTTP data.
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
CONFIG_MBEDTLS_SSL_IN_CONTENT_LEN=16384
CONFIG_MBEDTLS_SSL_OUT_CONTENT_LEN=16384
CONFIG_MBEDTLS_ECP_FIXED_POINT_OPTIM=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_HTTPD_MAX_REQ_HDR_LEN=768
CONFIG_HTTPD_MAX_URI_LEN=96
# 8 established TLS + 4 HTTP + 2 handshakes + 2 completed handoffs +
# 2 listeners, with headroom for DNS/SNTP/mDNS and the accept backlog.
CONFIG_LWIP_MAX_SOCKETS=24
CONFIG_LWIP_MAX_ACTIVE_TCP=24
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=11520
CONFIG_HTTPD_ERR_RESP_NO_DELAY=y
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=n
# Keep boot/panic diagnostics visible on the deployment USB port as well.
CONFIG_ESP_CONSOLE_SECONDARY_USB_SERIAL_JTAG=y
